[
    {
        "id": 0,
        "title": "Hadith 1",
        "arabicHadith": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عَبَّادُ بْنُ تَمِيمٍ الْمَازِنِيُّ أَنَّهُ سَمِعَ عَمَّهُ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا يَسْتَسْقِي فَجَعَلَ إِلَى النَّاسِ ظَهْرَهُ يَدْعُو اللَّهَ وَاسْتَقْبَلَ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ ثُمَّ صَلَّى رَكْعَتَيْنِ",
        "urduHadith": " ابن شہاب نے کہا:مجھےعباد بن تمیم مازنی نے خبر دی،انھوں نے اپنے چچاسے سنا اور وہ نبی کریم صلی اللہ علیہ وسلم  کے ساتھیوں میں سے تھے وہ کہہ رہے تھے:ایک دن رسول اللہ صلی اللہ علیہ وسلم  بارش کی دعا مانگنےکے لئے نکلے،اللہ سے دعاکرتے ہوئے اپنی پشت لوگوں کی طرف کی،منہ قبلہ کی طرف کیا اوراپنی چادر پلٹی،پھر دو رکعت نمازادا کی۔ ",
        "englishHadith": " Ibn Tamim narrated on the authority of his uncle ('Abdullah b. Zaid) that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went out to the place of prayer and prayed for rain and faced towards Qibla, and turned round his mantle and prayed two rak'ahs.",
        "info": "Sahih Muslim Hadith No: 2071"
    },
    {
        "id": 1,
        "title": "Hadith 2",
        "arabicHadith": "حَدَّثَنَا مُسَدَّدٌ ، حَدَّثَنَا إِسْمَاعِيلُ ، عَنْ أَيُّوبَ ، عَنْ نَافِعٍ ، عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : صَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَاشُورَاءَ ، وَأَمَرَ بِصِيَامِهِ ، فَلَمَّا فُرِضَ رَمَضَانُ تُرِكَ ، وَكَانَ عَبْدُ اللَّهِ لَا يَصُومُهُ ، إِلَّا أَنْ يُوَافِقَ صَوْمَهُ .",
        "urduHadith": " رسول اللہ صلی اللہ علیہ وسلم نے یوم عاشورہ کا روزہ رکھا تھا اور آپ صلی اللہ علیہ وسلم نے اس کے رکھنے کا صحابہ رضی اللہ عنہم کو ابتداء اسلام میں حکم دیا تھا، جب ماہ رمضان کے روزے فرض ہو گئے تو عاشورہ کا روزہ بطور فرض چھوڑ دیا گیا، عبداللہ بن عمر رضی اللہ عنہما عاشورہ کے دن روزہ نہ رکھتے مگر جب ان کے روزے کا دن ہی یوم عاشورہ آن پڑتا۔  ",
        "englishHadith": " Ibn Tamim narrated on the authority of his uncle ('Abdullah b. Zaid) that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went out to the place of prayer and prayed for rain and faced towards Qibla, and turned round his mantle and prayed two rak'ahs.",
        "info": "Sahih Bukhari Hadith No: 1892"
    },
    {
        "id": 2,
        "title": "Hadith 3",
        "arabicHadith": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ الْأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ : خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ شَبَابٌ لَا نَقْدِرُ عَلَى شَيْءٍ ، فَقَالَ :  يَا مَعْشَرَ الشَّبَابِ ، عَلَيْكُمْ بِالْبَاءَةِ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ ، فَمَنْ لَمْ يَسْتَطِعْ مِنْكُمُ الْبَاءَةَ فَعَلَيْهِ بِالصَّوْمِ ، فَإِنَّ الصَّوْمَ لَهُ وِجَاءٌ . قَالَ أَبُو عِيسَى : هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ، حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا الْأَعْمَشُ، عَنْ عُمَارَةَ نَحْوَهُ . قَالَ أَبُو عِيسَى : وَقَدْ رَوَى غَيْرُ وَاحِدٍ ، عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَ هَذَا ، وَرَوَى أَبُو مُعَاوِيَةَ، وَالْمُحَارِبِيُّ، عَنْ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ . قَالَ أَبُو عِيسَى : كِلَاهُمَا صَحِيحٌ .",
        "urduHadith": " ´عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ` ہم نبی اکرم صلی اللہ علیہ وسلم کے ساتھ نکلے، ہم نوجوان تھے، ہمارے پاس (شادی وغیرہ امور میں سے) کسی چیز کی مقدرت نہ تھی۔ تو آپ نے فرمایا: ”اے نوجوانوں کی جماعت! تمہارے اوپر ۱؎ نکاح لازم ہے، کیونکہ یہ نگاہ کو نیچی کرنے والا اور شرمگاہ کی حفاظت کرنے والا ہے۔ اور جو تم میں سے نکاح کی استطاعت نہ رکھتا ہو تو اس پر صوم کا اہتمام ضروری ہے، کیونکہ روزہ اس کے لیے ڈھال ہے“۔",
        "englishHadith": " Abdullah bin Mas'ud narrated: We went with Allah's Messenger, while we were young men who had nothing. He said: 'O young men! You should marry, for indeed it helps in lowering the gaze and protecting the private parts. Whoever among you is not able to marry, then let him fast, for indeed fasting will diminish his sexual desire. ",
        "info": "Jam e Tirmizi Hadees No: 1081"
    },
    {
        "id": 3,
        "title": "Hadith 4",
        "arabicHadith": "Dummy Hadith 4",
        "urduHadith": "Dummy Hadith 4",
        "englishHadith": "Dummy Hadith 4",
        "info": "Dummy Hadith 4"
    },
    {
        "id": 4,
        "title": "Hadith 5",
        "arabicHadith": "Dummy Hadith 5",
        "urduHadith": "Dummy Hadith 5",
        "englishHadith": "Dummy Hadith 5",
        "info": "Dummy Hadith 5"
    },
    {
        "id": 5,
        "title": "Hadith 6",
        "arabicHadith": "Dummy Hadith 6",
        "urduHadith": "Dummy Hadith 6",
        "englishHadith": "Dummy Hadith 6",
        "info": "Dummy Hadith 6"
    },
    {
        "id": 6,
        "title": "Hadith 7",
        "arabicHadith": "Dummy Hadith 7",
        "urduHadith": "Dummy Hadith 7",
        "englishHadith": "Dummy Hadith 7",
        "info": "Dummy Hadith 7"
    }
]