[
    {
        "id": 0,
        "title": "Hadith 1",
        "arabicHadith": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ ، قَالَ : أَخْبَرَنَا مَالِكٌ ، عَنْ أَبِي الزِّنَادِ ، عَنِ الْأَعْرَجِ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ :  لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي أَوْ عَلَى النَّاسِ لَأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ صَلَاةٍ ",
        "urduHadith": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر مجھے اپنی امت یا لوگوں کی تکلیف کا خیال نہ ہوتا تو میں ہر نماز کے لیے ان کو مسواک کا حکم دے دیتا۔",
        "englishHadith": "Allah's Apostle said, If I had not found it hard for my followers or the people, I would have ordered them to clean their teeth with Siwak for every prayer.",
        "info": "Sahih Bukhari Hadith No: 887"
    },
    {
        "id": 1,
        "title": "Hadith 2",
        "arabicHadith": "حَدَّثَنَا آدَمُ ، حَدَّثَنَا شُعْبَةُ ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : مَا أَسْفَلَ مِنَ الْكَعْبَيْنِ مِنَ الْإِزَارِ فَفِي النَّارِ .        ",
        "urduHadith": "  تہبند کا جو حصہ ٹخنوں سے نیچے لٹکا ہو وہ جہنم میں ہو گا۔“ ",
        "englishHadith": "The part of an Izar which hangs below the ankles is in the Fire.",
        "info": "Sahih Bukhari Hadith No: 5787"
    },
    {
        "id": 2,
        "title": "Hadith 3",
        "arabicHadith": "الْمَلاَئِكَةُ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مُصَلاَّهُ الَّذِي صَلَّى فِيهِ، مَا لَمْ يُحْدِثْ، تَقُولُ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ",
        "urduHadith": " ملائکہ تم میں سے اس نمازی کے لیے اس وقت تک یوں دعا کرتے رہتے ہیں۔ جب تک ( نماز پڑھنے کے بعد) وہ اپنے مصلے پر بیٹھا رہے «اللهم اغفر له،اللهم ارحمه» کہ اے اللہ! اس کی مغفرت کر۔ اے اللہ! اس پر رحم کر۔",
        "englishHadith": "The angels keep on asking for Allah's Blessing and Forgiveness for anyone of you as long as he is at his Musalla (praying place) and does not do Hadath (passes wind). The angels say, 'O Allah! Forgive him and be Merciful to him.'",
        "info": "Sahih Bukhari Hadith No: 659"
    },
    {
        "id": 3,
        "title": "Hadith 4",
        "arabicHadith": "إِذَا قَالَ الرَّجُلُ لأَخِيهِ يَا كَافِرُ فَقَدْ بَاءَ بِهِ أَحَدُهُمَا",
        "urduHadith": "جب کوئی شخص اپنے کسی بھائی کو کہتا ہے کہ اے کافر! تو ان دونوں میں سے ایک کافر ہو گیا۔",
        "englishHadith": "If a man says to his brother, O Kafir (disbeliever)!' Then surely one of them is such (i.e., a Kafir).",
        "info": "Sahih Bukhari Hadith No: 6103"
    },
    {
        "id": 4,
        "title": "Hadith 5",
        "arabicHadith": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ ، حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ ، أَخْبَرَنِي عَاصِمٌ الأَحْوَلُ ، عَنْ الشَّعْبِيِّ ، عَنْ عَدِيِّ بْنِ حَاتِمٍ ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : إِذَا وَقَعَتْ رَمِيَّتُكَ فِي مَاءٍ فَغَرِقَ فَمَاتَ فَلَا تَأْكُلْ.,",
        "urduHadith": " جب تمہارے تیر کا شکار پانی میں گر پڑے اور ڈوب کر مر جائے تو اسے مت کھاؤ۔",
        "englishHadith": "When the animal at which you shot falls in water, is drowned, and dies, do not eat.",
        "info": "Sunan Abi Dawud Hadith No: 2850"
    },
    {
        "id": 5,
        "title": "Hadith 6",
        "arabicHadith": "حَدَّثَنَا مُسَدَّدٌ ، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ ، حَدَّثَنِي عُبَيْدُ اللَّهِ ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ ، عَنْ أَبِيهِ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ :  تُنْكَحُ النِّسَاءُ لِأَرْبَعٍ : لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا ، فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ  .        ",
        "urduHadith": "عورتوں سے نکاح چار چیزوں کی بنا پر کیا جاتا ہے: ان کے مال کی وجہ سے، ان کے حسب و نسب کی وجہ سے، ان کی خوبصورتی کی بنا پر، اور ان کی دین داری کے سبب، تم دیندار عورت سے نکاح کر کے کامیاب بن جاؤ۔",
        "englishHadith": "Women may be married for four reasons: for her property, her ranks, her beauty and her religiosity. So get the one who is religious and prosper",
        "info": "Sunan Abi Dawud Hadith No: 2047"
    },
    {
        "id": 6,
        "title": "Hadith 7",
        "arabicHadith": "إِذَا مَاتَ الإِنْسَانُ انْقَطَعَ عَمَلُهُ إِلاَّ مِنْ ثَلاَثٍ: صَدَقَةٌ جَارِيَةٌ وَعِلْمٌ يُنْتَفَعُ بِهِ وَوَلَدٌ صَالِحٌ يَدْعُو لَهُ",
        "urduHadith": "جب انسان فوت ہو جائے تو اس کا عمل منقطع ہو جاتا ہے سوائے تین اعمال کے (وہ منقطع نہیں ہوتے): صدقہ جاریہ یا ایسا علم جس سے فائدہ اٹھایا جائے یا نیک بیٹا جو اس کے لیے دعا کرے۔",
        "englishHadith": "When a person dies, then all his deeds come to an end except for three:1 – A continuous charity 2 – Knowledge left behind that continues to benefit 3 – A righteous child who prays for him ",
        "info": "Sahih Muslim Hadith No: 1631"
    },
    {
        "id": 7,
        "title": "Hadith 8",
        "arabicHadith": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ ، حَدَّثَنَا مَرْوَانُ الْفَزَارِيُّ ، حَدَّثَنَا أَبُو يَعْفُورٍ ، عَنِ الْوَلِيدِ بْنِ الْعَيْزَارِ ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ، قَالَ : قُلْتُ : يَا نَبِيَّ اللَّهِ ، أَيُّ الأَعْمَالِ أَقْرَبُ إِلَى الْجَنَّةِ ؟ قَالَ : الصَّلَاةُ عَلَى مَوَاقِيتِهَا ، قُلْتُ : وَمَاذَا يَا نَبِيَّ اللَّهِ ؟ قَالَ : بِرُّ الْوَالِدَيْنِ ، قُلْتُ : وَمَاذَا يَا نَبِيَّ اللَّهِ ؟ قَالَ : الْجِهَادُ فِي سَبِيلِ اللَّهِ ",
        "urduHadith": " ابو یعفور  (  عبد  الرحمان بن عبید بن نسطانس  )  نے ولید بن عیزار کے حوالے سے ابو عمرو شیبانی سے حدیث بیان کی اور انہوں نے حضرت عبد اللہ بن مسعود رضی ‌اللہ ‌عنہ  سے روایت کی ، انہوں نے کہا : میں نے پوچھا : اے اللہ کے نبی !کون سا عمل جنت سے زیادہ قریب  ( کردیتا )  ہے ؟ فرمایا: ’’نمازیں اپنے اپنے اوقات پر پڑھنا ۔‘‘ میں نے پوچھا : اے اللہ کے نبی ! اور کیا ؟ فرمایا : ’’ والدین کے ساتھ حسن سلوک کرنا ۔ ‘‘ میں نے پوچھا : اے اللہ کے نبی ! اور کیا ؟ فرمایا :’’ اللہ کی راہ میں جہاد کرنا ۔ ‘‘ ",
        "englishHadith": " Abdullah b. Mas'ud reported:  I said: Messenger of Allah, which of the deeds (takes one) nearer to Paradise? He (the Holy Prophet) replied: Prayer at its proper time, I said: What next, Messenger of Allah? He replied: Kindness to the parents. I said: What next? He replied: Jihad in the cause of Allah. ",
        "info": "Sahih Muslim Hadith No: 253"
    },
    {
        "id": 8,
        "title": "Hadith 9",
        "arabicHadith": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ ، قَالَ : حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ ، عَنْ سَلَمَةَ ، قَالَ : سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، يَقُولُ :  مَنْ يَقُلْ عَلَيَّ مَا لَمْ أَقُلْ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ",
        "urduHadith": "رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا کہ جو شخص میرے نام سے وہ بات بیان کرے جو میں نے نہیں کہی تو وہ اپنا ٹھکانا جہنم میں بنا لے۔",
        "englishHadith": "Whoever (intentionally) ascribes to me what I have not said then (surely) let him occupy his seat in Hell-fire.",
        "info": "Sahih Bukhari Hadith No: 109"
    },
    {
        "id": 9,
        "title": "Hadith 10",
        "arabicHadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ ، حَدَّثَنَا سُفْيَانُ ، عَنْ الْأَعْمَشِ ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ ، عَنْ مَسْرُوقٍ ، عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ , قَالَ :  لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ , وَشَقَّ الْجُيُوبَ , وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ",
        "urduHadith": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص  ( کسی میت پر )  اپنے رخسار پیٹے ‘ گریبان پھاڑے اور عہد جاہلیت کی سی باتیں کرے وہ ہم میں سے نہیں ہے۔ ",
        "englishHadith": "The Prophet said,   He who slaps the cheeks, tears the clothes and follows the tradition of the Days of Ignorance is not from us.  ",
        "info": "Sahih Bukhari Hadith No: 1297"
    },
    {
        "id": 10,
        "title": "Hadith 11",
        "arabicHadith": "مَنْ صَلَّى عَلَىَّ صَلاَةً وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرَ صَلَوَاتٍ وَحُطَّتْ عَنْهُ عَشْرُ خَطِيئَاتٍ وَرُفِعَتْ لَهُ عَشْرُ دَرَجَاتٍ",
        "urduHadith": " مجھ پر صلاۃ ( درود و رحمت )  بھیجو، اور دعا میں کوشش کرو، اور کہو: «اللہم صل على محمد وعلى آل محمد»  اے اللہ! صلاۃ  ( درود و رحمت )  بھیج محمد پر اور آل محمد پر",
        "englishHadith": "Whoever sends salah upon me once, Allah (SWT) will send salah upon him tenfold, and will erase ten sins from him, and will raise him ten degrees in status.",
        "info": " Sunan an-Nasa'i Hadith No: 1297"
    },
    {
        "id": 11,
        "title": "Hadith 12",
        "arabicHadith": "إِنَّ اللَّهَ لاَ يَنْظُرُ إِلَى صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ",
        "urduHadith": "اللہ تعالیٰ تمہاری صورتوں اور تمہارے اموال کی طرف نہیں دیکھتا ، لیکن وہ تمہارے دلوں اور اعمال کی طرف دیکھتا ہے ۔",
        "englishHadith": "Verily Allah does not look to your faces and your wealth but He looks to your heart and to your deeds.",
        "info": "Sahih Muslim Hadith No: 6543"
    },
    {
        "id": 12,
        "title": "Hadith 13",
        "arabicHadith": "الدُّنْيَا سِجْنُ الْمُؤْمِنِ وَجَنَّةُ الْكَافِرِ",
        "urduHadith": "دنیا مومن کے لیے قید خانہ اور کافر کے لیے جنت ہے۔",
        "englishHadith": "The world is a prison for the believer and a paradise for the disbeliever. ",
        "info": "Sahih Muslim Hadith No: 2956"
    },
    {
        "id": 13,
        "title": "Hadith 14",
        "arabicHadith": "التَّثَاؤُبُ مِنَ الشَّيْطَانِ فَإِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَكْظِمْ مَا اسْتَطَاعَ",
        "urduHadith": "جمائی شیطان کی طرف سے ہے۔ پس جب کسی کو جمائی آئے تو جہاں تک ہو سکے اسے روکے۔ کیونکہ جب کوئی  ( جمائی لیتے ہوئے )  ”ہاہا“ کرتا ہے تو شیطان اس پر ہنستا ہے۔",
        "englishHadith": "Yawning is from the devil so whenever one of you yawns, then let him try to suppress it as much as possible.        ",
        "info": "Sahih Bukhari Hadith No: 3289"
    },
    {
        "id": 14,
        "title": "Hadith 15",
        "arabicHadith": "مَا يُصِيبُ الْمُسْلِمَ مِنْ نَصَبٍ وَلاَ وَصَبٍ وَلاَ هَمٍّ وَلاَ حُزْنٍ وَلاَ أَذًى وَلاَ غَمٍّ حَتَّى الشَّوْكَةِ يُشَاكُهَا، إِلاَّ كَفَّرَ اللَّهُ بِهَا مِنْ خَطَايَاهُ",
        "urduHadith": "مسلمان جب بھی کسی پریشانی، بیماری، رنج و ملال، تکلیف اور غم میں مبتلا ہو جاتا ہے یہاں تک کہ اگر اسے کوئی کانٹا بھی چبھ جائے تو اللہ تعالیٰ اسے اس کے گناہوں کا کفارہ بنا دیتا ہے۔",
        "englishHadith": "No fatigue, illness, worry, sorrow, harm, grief, or even the prick of a thorn afflicts a Muslim except that Allah expiates some of his sins by it.",
        "info": "Sahih Bukhari Hadith No: 5641"
    },
    {
        "id": 15,
        "title": "Hadith 16",
        "arabicHadith": "حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ خَمْسٌ: رَدُّ السَّلَامِ وَعِيَادَةُ الْمَرِيضِ وَاتِّبَاعُ الْجَنَائِزِ وَإِجَابَةُ الدعْوَة و تَشْمِيتُ الْعَاطِس        ",
        "urduHadith": "مسلمان کے مسلمان پر پانچ حق ہیں سلام کا جواب دینا، مریض کا مزاج معلوم کرنا، جنازے کے ساتھ چلنا، دعوت قبول کرنا، اور چھینک پر  ( اس کے «الحمدلله» کے جواب میں )  «يرحمک الله» کہنا۔",
        "englishHadith": "A Muslim has five rights on another Muslim: 1 – Return the greeting of salam 2 – Visiting the sick 3 – Following the funeral 4 – Accepting an invitation5 – Saying Yarhamuka Allah (God have mercy on you) to the one who sneezes",
        "info": "Sahih Bukhari Hadith No: 1240"
    },
    {
        "id": 16,
        "title": "Hadith 17",
        "arabicHadith": "مَا عَابَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ طَعَامًا قَطُّ إِنِ اشْتَهَاهُ أَكَلَهُ وَإِنْ كَرِهَهُ تَرَكَهُ",
        "urduHadith": "نبی کریم صلی اللہ علیہ وسلم نے کبھی کسی کھانے میں کوئی عیب نہیں نکالا۔ اگر پسند ہوا تو کھا لیا اور اگر ناپسند ہوا تو چھوڑ دیا۔ ",
        "englishHadith": "The Prophet (ﷺ) would never find fault with food. If he desired it, he would eat. If he disliked it, he would leave it.        ",
        "info": "Sahih Bukhari Hadith No: 5409"
    },
    {
        "id": 17,
        "title": "Hadith 18",
        "arabicHadith": "مَنْ غَدَا إِلَى الْمَسْجِدِ أَوْ رَاحَ أَعَدَّ اللهُ لَهُ فِي الْجَنَّةِ نُزُلاً كُلَّمَا غَدَا أَوْ رَاحَ",
        "urduHadith": "جو شخص مسجد میں صبح شام بار بار حاضری دیتا ہے۔ اللہ تعالیٰ جنت میں اس کی مہمانی کا سامان کرے گا۔ وہ صبح شام جب بھی مسجد میں جائے۔",
        "englishHadith": "Whenever someone goes to the mosque in the morning or evening, Allah prepares for him a place in paradise.        ",
        "info": "Sahih Bukhari Hadith No: 662"
    },
    {
        "id": 18,
        "title": "Hadith 19",
        "arabicHadith": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ ، قَالَ : حَدَّثَنَا سُفْيَانُ ، عَنِ الْأَعْمَشِ ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ ، عَنْ مَسْرُوقٍ ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ :  أَرْبَعٌ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا خَالِصًا ، وَمَنْ كَانَتْ فِيهِ خَصْلَةٌ مِنْهُنَّ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ حَتَّى يَدَعَهَا إِذَا ، اؤْتُمِنَ خَانَ ، وَإِذَا حَدَّثَ كَذَبَ ، وَإِذَا عَاهَدَ غَدَرَ ، وَإِذَا خَاصَمَ فَجَرَ  ، تَابَعَهُ شُعْبَةُ ، عَنِ الْأَعْمَشِ .        ",
        "urduHadith": "چار عادتیں جس کسی میں ہوں تو وہ خالص منافق ہے اور جس کسی میں ان چاروں میں سے ایک عادت ہو تو وہ  ( بھی )  نفاق ہی ہے، جب تک اسے نہ چھوڑ دے۔  ( وہ یہ ہیں )  جب اسے امین بنایا جائے تو  ( امانت میں )  خیانت کرے اور بات کرتے وقت جھوٹ بولے اور جب  ( کسی سے )  عہد کرے تو اسے پورا نہ کرے اور جب  ( کسی سے )  لڑے تو گالیوں پر اتر آئے۔",
        "englishHadith": "Whoever has the following four (characteristics) will be a pure hypocrite and whoever has one of the following four characteristics will have one characteristic of hypocrisy unless and until he gives it up. 1. Whenever he is entrusted, he betrays. 2. Whenever he speaks, he tells a lie. 3. Whenever he makes a covenant, he proves treacherous. 4. Whenever he quarrels, he behaves in a very imprudent, evil and insulting manner.",
        "info": "Sahih Bukhari Hadith No: 34"
    },
    {
        "id": 19,
        "title": "Hadith 20",
        "arabicHadith": "جُزُّوا الشَّوَارِبَ وَأَرْخُوا اللِّحَى خَالِفُوا الْمَجُوسَ",
        "urduHadith": "مونچھیں کاٹو اور داڑھیاں بڑھاؤ",
        "englishHadith": "Trim the mustache and leave the beard. Differ from the Magians.",
        "info": "Jam e Tirmazi Hadith No: 2763"
    },
    {
        "id": 20,
        "title": "Hadith 21",
        "arabicHadith": " لاَ تَجْعَلُوا بُيُوتَكُمْ مَقَابِرَ إِنَّ الشَّيْطَانَ يَنْفِرُ مِنَ الْبَيْتِ الَّذِي تُقْرَأُ فِيهِ سُورَةُ الْبَقَرَةِ",
        "urduHadith": "اپنے گھروں کو قبرستان نہ بنائیں۔ بے شک شیطان اس گھر سے بھاگتا ہے جس میں سورۃ البقرہ پڑھی جاتی ہے۔",
        "englishHadith": "Do not make your homes into graveyards. Verily, the devil flees from the house in which Surah al-Baqarah is read.        ",
        "info": "Riyad as-Saliheen Hadith No: 1018 "
    },
    {
        "id": 21,
        "title": "Hadith 22",
        "arabicHadith": "لاَ يَدْخُلُ الْجَنَّةَ مَنْ لاَ يَأْمَنُ جَارُهُ بَوَائِقَهُ",
        "urduHadith": "جس کا پڑوسی اس کے شر سے محفوظ نہ ہو وہ جنت میں نہیں جائے گا۔",
        "englishHadith": "One whose neighbor is not safe from his evil will not enter paradise.",
        "info": "Sahih Muslim Hadith No: 46"
    },
    {
        "id": 22,
        "title": "Hadith 23",
        "arabicHadith": "أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ فَأَكثِرُوا الدُّعَاءَ",
        "urduHadith": "بندہ سجدے کی حالت میں اپنے رب کے قریب ہو جاتا ہے۔ لہٰذا سجدے میں دعاؤں میں کثرت کرو۔",
        "englishHadith": "When a slave prostrates, he is the closest to his Lord. So increase your supplications [during that time].        ",
        "info": "Riyad as-Salihin Hadith No: 1428"
    },
    {
        "id": 23,
        "title": "Hadith 24",
        "arabicHadith": "مَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللهُ لَهُ طَرِيقًا إِلَى الْجَنَّةِ",
        "urduHadith": "جو علم حاصل کرنے کے ارادہ سے کہیں جائے، تو اللہ اس کے لیے جنت کے راستے کو آسان  ( و ہموار )  کر دیتا ہے",
        "englishHadith": "Whoever takes a path in pursuit of knowledge, Allah will make easy for him the path to paradise.",
        "info": "Jam e Tirmidhi Hadith No: 2646"
    },
    {
        "id": 24,
        "title": "Hadith 25",
        "arabicHadith": " إِنَّ اللَّهَ يَقُولُ يَوْمَ الْقِيَامَةِ أَيْنَ الْمُتَحَابُّونَ بِجَلاَلِي الْيَوْمَ أُظِلُّهُمْ فِي ظِلِّي يَوْمَ لاَ ظِلَّ إِلاَّ ظِلِّي",
        "urduHadith": "یقیناً اللہ تعالیٰ قیامت کے دن فرمائے گا کہ کہاں ہیں وہ لوگ جو میری شان کے لیے ایک دوسرے سے محبت کرتے تھے؟ آج میں انہیں اپنے سائے میں ڈھانپوں گا جب میرے سوا کوئی سایہ نہیں ہوگا۔‘‘",
        "englishHadith": "Verily, Allah will say on the Day of Judgment, “Where are those who [used to] love one another for the sake of my Glory? Today, I will cover them in my shade when there is no shade but mine.”",
        "info": "Riyad as-Salihin Hadith No: 377"
    },
    {
        "id": 25,
        "title": "Hadith 26",
        "arabicHadith": "سَدِّدُوا وَقَارِبُوا، وَاعْلَمُوا أَنْ لَنْ يُدْخِلَ أَحَدَكُمْ عَمَلُهُ الْجَنَّةَ، وَأَنَّ أَحَبَّ الأَعْمَالِ أَدْوَمُهَا إِلَى اللهِ وَإِنْ قَلَّ",
        "urduHadith": "درمیانی چال اختیار کرو اور بلند پروازی نہ کرو اور عمل کرتے رہو، تم میں سے کسی کا عمل اسے جنت میں نہیں داخل کر سکے گا، میرے نزدیک سب سے پسندیدہ عمل وہ ہے جس پر ہمیشگی کی جائے خواہ کم ہی کیوں نہ ہو۔",
        "englishHadith": "Do good deeds properly, sincerely and moderately and know that your deeds will not make you enter Paradise, and that the most beloved deed to Allah's is the most regular and constant even though it were little. ",
        "info": "Sahih al-Bukhari Hadith No: 6464"
    },
    {
        "id": 26,
        "title": "Hadith 27",
        "arabicHadith": "لَقِّنُوا مَوْتَاكُمْ لاَ إِلَهَ إِلاَّ اللهُ",
        "urduHadith": "اپنے مرنے والوں کو لا الہ الا اللہ کہنے کی تلقین کریں (اللہ کے سوا کوئی عبادت کے لائق نہیں)",
        "englishHadith": "Instruct your dying ones to say: La ilaha illa Allah (There is no deity worthy of worship except Allah)        ",
        "info": "Riyad as-Salihin Hadith No: 918"
    },
    {
        "id": 27,
        "title": "Hadith 28",
        "arabicHadith": "مَنْ صَلَّى عَلَيَّ وَاحِدَةً صَلَّى اللهُ عَلَيْهِ عشرا",
        "urduHadith": "جس نے مجھ پر ایک درود بھیجا اللہ تعالیٰ اس پر دس رحمتیں نازل فرمائے گا۔",
        "englishHadith": "Whoever sent one blessing on me, Allah will send ten blessings on him.",
        "info": "Sahih Muslim Hadith No: 384"
    },
    {
        "id": 28,
        "title": "Hadith 29",
        "arabicHadith": "مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يُؤْذِ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ",
        "urduHadith": "جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو، اس پر لازم ہے کہ اپنے پڑوسی کو تکلیف نہ دے، جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو، اس پر لازم ہے کہ اپنے مہمان کی عزت کرے اور جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو، اس پر لازم ہے کہ بھلی بات کہے ورنہ چپ رہے۔",
        "englishHadith": "Whoever believes in Allah and the Last Day, should not hurt his neighbor and whoever believes in Allah and the Last Day, should serve his guest generously and whoever believes in Allah and the Last Day, should speak what is good or keep silent.",
        "info": "Sahih al-Bukhari Hadith No: 6136"
    },
    {
        "id": 29,
        "title": "Hadith 30",
        "arabicHadith": "حَدَّثَنِي يَحْيَى بْنُ يُوسُفَ ، أَخْبَرَنَا أَبُو بَكْرٍ هُوَ ابْنُ عَيَّاشٍ ، عَنْ أَبِي حَصِينٍ ، عَنْ أَبِي صَالِحٍ ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ ، أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَوْصِنِي ، قَالَ :  لَا تَغْضَبْ  فَرَدَّدَ مِرَارًا ، قَالَ :  لَا تَغْضَبْ  .",
        "urduHadith": "ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے عرض کیا کہ مجھے آپ کوئی نصیحت فرما دیجئیے۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ غصہ نہ ہوا کر۔ انہوں نے کئی مرتبہ یہ سوال کیا اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ غصہ نہ ہوا کر۔ ",
        "englishHadith": "A man said to the Prophet ,   Advise me!   The Prophet said,   Do not become angry and furious.   The man asked (the same) again and again, and the Prophet said in each case,   Do not become angry and furious. ",
        "info": ""
    }
]