[
    {
        "id": 0,
        "title": "Hadith 1",
        "arabicHadith": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عَبَّادُ بْنُ تَمِيمٍ الْمَازِنِيُّ أَنَّهُ سَمِعَ عَمَّهُ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا يَسْتَسْقِي فَجَعَلَ إِلَى النَّاسِ ظَهْرَهُ يَدْعُو اللَّهَ وَاسْتَقْبَلَ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ ثُمَّ صَلَّى رَكْعَتَيْنِ",
        "urduHadith": " ابن شہاب نے کہا:مجھےعباد بن تمیم مازنی نے خبر دی،انھوں نے اپنے چچاسے سنا اور وہ نبی کریم صلی اللہ علیہ وسلم  کے ساتھیوں میں سے تھے وہ کہہ رہے تھے:ایک دن رسول اللہ صلی اللہ علیہ وسلم  بارش کی دعا مانگنےکے لئے نکلے،اللہ سے دعاکرتے ہوئے اپنی پشت لوگوں کی طرف کی،منہ قبلہ کی طرف کیا اوراپنی چادر پلٹی،پھر دو رکعت نمازادا کی۔ ",
        "englishHadith": " Ibn Tamim narrated on the authority of his uncle ('Abdullah b. Zaid) that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went out to the place of prayer and prayed for rain and faced towards Qibla, and turned round his mantle and prayed two rak'ahs.",
        "info": "Sahih Muslim Hadith No: 2071"
    },
    {
        "id": 1,
        "title": "Hadith 2",
        "arabicHadith": "حَدَّثَنَا مُسَدَّدٌ ، حَدَّثَنَا إِسْمَاعِيلُ ، عَنْ أَيُّوبَ ، عَنْ نَافِعٍ ، عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ ، قَالَ : صَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَاشُورَاءَ ، وَأَمَرَ بِصِيَامِهِ ، فَلَمَّا فُرِضَ رَمَضَانُ تُرِكَ ، وَكَانَ عَبْدُ اللَّهِ لَا يَصُومُهُ ، إِلَّا أَنْ يُوَافِقَ صَوْمَهُ .",
        "urduHadith": " رسول اللہ صلی اللہ علیہ وسلم نے یوم عاشورہ کا روزہ رکھا تھا اور آپ صلی اللہ علیہ وسلم نے اس کے رکھنے کا صحابہ رضی اللہ عنہم کو ابتداء اسلام میں حکم دیا تھا، جب ماہ رمضان کے روزے فرض ہو گئے تو عاشورہ کا روزہ بطور فرض چھوڑ دیا گیا، عبداللہ بن عمر رضی اللہ عنہما عاشورہ کے دن روزہ نہ رکھتے مگر جب ان کے روزے کا دن ہی یوم عاشورہ آن پڑتا۔  ",
        "englishHadith": " Ibn Tamim narrated on the authority of his uncle ('Abdullah b. Zaid) that the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) went out to the place of prayer and prayed for rain and faced towards Qibla, and turned round his mantle and prayed two rak'ahs.",
        "info": "Sahih Bukhari Hadith No: 1892"
    },
    {
        "id": 2,
        "title": "Hadith 3",
        "arabicHadith": "وَرَوَى عِيسَى ، عَنْ رَقَبَةَ عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ ، قَالَ : سَمِعْتُ عُمَرَ رَضِيَ اللَّهُ عَنْهُ ، يَقُولُ : قَامَ فِينَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَامًا فَأَخْبَرَنَا عَنْ بَدْءِ الْخَلْقِ حَتَّى دَخَلَ أَهْلُ الْجَنَّةِ مَنَازِلَهُمْ ، وَأَهْلُ النَّارِ مَنَازِلَهُمْ ، حَفِظَ ذَلِكَ مَنْ حَفِظَهُ ، وَنَسِيَهُ مَنْ نَسِيَهُ ",
        "urduHadith": "´اور عیسیٰ نے رقبہ سے روایت کیا، انہوں نے قیس بن مسلم سے، انہوں نے طارق بن شہاب سے، انہوں نے بیان کیا کہ میں نے عمر بن خطاب رضی اللہ عنہ سے سنا، آپ نے کہا کہ` ایک مرتبہ نبی کریم صلی اللہ علیہ وسلم نے منبر پر کھڑے ہو کر ہمیں وعظ فرمایا اور ابتدائے خلق کے بارے میں ہمیں خبر دی۔ یہاں تک کہ جب جنت والے اپنی منزلوں میں داخل ہو جائیں گے اور جہنم والے اپنے ٹھکانوں کو پہنچ جائیں گے (وہاں تک ساری تفصیل کو آپ نے بیان فرمایا) جسے اس حدیث کو یاد رکھنا تھا اس نے یاد رکھا اور جسے بھولنا تھا وہ بھول گیا۔ ",
        "englishHadith": "Narrated 'Umar: One day the Prophet stood up amongst us for a long period and informed us about the beginning of creation (and talked about everything in detail) till he mentioned how the people of Paradise will enter their places and the people of Hell will enter their places. Some remembered what he had said, and some forgot it.        ",
        "info": "Sahih Bukhari Hadith No: 3192"
    },
    {
        "id": 3,
        "title": "Hadith 4",
        "arabicHadith": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ ، عَنَ التَّيْمِيِّ ، عَنْ أَبِي الْمِنْهَالِ ، عَنْ أَبِي بَرْزَةَ ،  أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، كَانَ يَقْرَأُ فِي صَلَاةِ الْغَدَاةِ ، مِنَ السِّتِّينَ إِلَى الْمِائَةِ ",
        "urduHadith": " سلیمان )  تیمی نے ابو منہال سے اور انہوں نے حضرت ابو برزہ  رضی ‌اللہ ‌عنہ  سے روایت کی کہ رسول اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم صبح کی نماز میں ساٹھ سے سو آیات تک پڑھا کرتے تھے۔ ",
        "englishHadith": " Abu Barza reported:The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم‌ ) used to recite in the morning prayer from sixty to one hundred verses. ",
        "info": "Sahih Muslim Hadith No: 1031"
    },
    {
        "id": 4,
        "title": "Hadith 5",
        "arabicHadith": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ ، حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ ، أَخْبَرَنِي عَاصِمٌ الأَحْوَلُ ، عَنْ الشَّعْبِيِّ ، عَنْ عَدِيِّ بْنِ حَاتِمٍ ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : إِذَا وَقَعَتْ رَمِيَّتُكَ فِي مَاءٍ فَغَرِقَ فَمَاتَ فَلَا تَأْكُلْ.,",
        "urduHadith": "´عدی بن حاتم رضی اللہ عنہ کہتے ہیں کہ` نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جب تمہارے تیر کا شکار پانی میں گر پڑے اور ڈوب کر مر جائے تو اسے مت کھاؤ“۔        ",
        "englishHadith": "Narrated Adi bin Hatim: The Prophet ﷺ as saying: When the animal at which you shot falls in water, is drowned, and dies, do not eat.        ",
        "info": "Sunan Abi Dawud Hadith No: 2850"
    },
    {
        "id": 5,
        "title": "Hadith 6",
        "arabicHadith": "حَدَّثَنَا مُسَدَّدٌ ، حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ ، حَدَّثَنِي عُبَيْدُ اللَّهِ ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ ، عَنْ أَبِيهِ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ :  تُنْكَحُ النِّسَاءُ لِأَرْبَعٍ : لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا ، فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ  .        ",
        "urduHadith": "´ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ` نبی اکرم صلی اللہ علیہ وسلم نے ارشاد فرمایا: ”عورتوں سے نکاح چار چیزوں کی بنا پر کیا جاتا ہے: ان کے مال کی وجہ سے، ان کے حسب و نسب کی وجہ سے، ان کی خوبصورتی کی بنا پر، اور ان کی دین داری کے سبب، تم دیندار عورت سے نکاح کر کے کامیاب بن جاؤ، تمہارے ہاتھ خاک آلود ہوں ۱؎“۔        ",
        "englishHadith": "Abu Hurairah reported the Prophet ﷺ as saying “Women may be married for four reasons: for her property, her ranks, her beauty and her religiosity. So get the one who is religious and prosper (lit. may your hands cleave to the dust). ”        ",
        "info": "Sunan Abi Dawud Hadith No: 2047"
    },
    {
        "id": 6,
        "title": "Hadith 7",
        "arabicHadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَاللَّفْظُ لِأَبِي كُرَيْبٍ ، قَالَا : حَدَّثَنَا أَبُو مُعَاوِيَةَ ، عَنِ الأَعْمَشِ ، عَنْ أَبِي سُفْيَانَ ، عَنْ جَابِرٍ ، قَالَ : أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النُّعْمَانُ بْنُ قَوْقَلٍ ، فَقَالَ : يَا رَسُولَ اللَّهِ ،  أَرَأَيْتَ إِذَا صَلَّيْتُ الْمَكْتُوبَةَ ، وَحَرَّمْتُ الْحَرَامَ ، وَأَحْلَلْتُ الْحَلَالَ ، أَأَدْخُلُ الْجَنَّة ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : نَعَمْ.        ",
        "urduHadith": " ابومعاویہ نے اعمش سے حدیث سنائی ، انہوں نے ابو سفیان سے اور انہوں نے حضرت جابر رضی ‌اللہ ‌عنہ  سے روایت کی کہ رسول اللہ  ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌  کے پاس نعمان بن قوقل  رضی ‌اللہ ‌عنہ  آئے اور کہا : اے اللہ کے رسول ! آپ کیا فرماتے ہیں کہ جب میں فرض نماز ادا کروں، حرام کو حرام اور حلال کو حلال سمجھوں تو کیا میں جنت میں داخل ہو جاؤں گا ؟ نبی  ‌صلی ‌اللہ ‌علیہ ‌وسلم  نے فرمایا : ’’ہاں!‘‘ ",
        "englishHadith": " It is narrated on the authority of Jabir that Nu'man b. Qaufal came to the Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and said:  Would I enter Paradise if I say the obligatory prayers and deny myself that which is forbidden and treat that as lawful what has been made permissible (by the Shari'ah)? The Prophet ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) replied in the affirmative. ",
        "info": "Sahih Muslim Hadith No: 108"
    },
    {
        "id": 7,
        "title": "Hadith 8",
        "arabicHadith": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ ، حَدَّثَنَا مَرْوَانُ الْفَزَارِيُّ ، حَدَّثَنَا أَبُو يَعْفُورٍ ، عَنِ الْوَلِيدِ بْنِ الْعَيْزَارِ ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ، قَالَ : قُلْتُ : يَا نَبِيَّ اللَّهِ ، أَيُّ الأَعْمَالِ أَقْرَبُ إِلَى الْجَنَّةِ ؟ قَالَ : الصَّلَاةُ عَلَى مَوَاقِيتِهَا ، قُلْتُ : وَمَاذَا يَا نَبِيَّ اللَّهِ ؟ قَالَ : بِرُّ الْوَالِدَيْنِ ، قُلْتُ : وَمَاذَا يَا نَبِيَّ اللَّهِ ؟ قَالَ : الْجِهَادُ فِي سَبِيلِ اللَّهِ ",
        "urduHadith": " ابو یعفور  (  عبد  الرحمان بن عبید بن نسطانس  )  نے ولید بن عیزار کے حوالے سے ابو عمرو شیبانی سے حدیث بیان کی اور انہوں نے حضرت عبد اللہ بن مسعود رضی ‌اللہ ‌عنہ  سے روایت کی ، انہوں نے کہا : میں نے پوچھا : اے اللہ کے نبی !کون سا عمل جنت سے زیادہ قریب  ( کردیتا )  ہے ؟ فرمایا: ’’نمازیں اپنے اپنے اوقات پر پڑھنا ۔‘‘ میں نے پوچھا : اے اللہ کے نبی ! اور کیا ؟ فرمایا : ’’ والدین کے ساتھ حسن سلوک کرنا ۔ ‘‘ میں نے پوچھا : اے اللہ کے نبی ! اور کیا ؟ فرمایا :’’ اللہ کی راہ میں جہاد کرنا ۔ ‘‘ ",
        "englishHadith": " Abdullah b. Mas'ud reported:  I said: Messenger of Allah, which of the deeds (takes one) nearer to Paradise? He (the Holy Prophet) replied: Prayer at its proper time, I said: What next, Messenger of Allah? He replied: Kindness to the parents. I said: What next? He replied: Jihad in the cause of Allah. ",
        "info": "Sahih Muslim Hadith No: 253"
    },
    {
        "id": 8,
        "title": "Hadith 9",
        "arabicHadith": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ ، قَالَ : حَدَّثَنَا اللَّيْثُ ، عَنْ خَالِدٍ ، عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ ، عَنْ نُعَيْمٍ الْمُجْمِرِ ، قَالَ : رَقِيتُ مَعَ أَبِي هُرَيْرَةَ عَلَى ظَهْرِ الْمَسْجِدِ فَتَوَضَّأَ ، فَقَالَ : إِنِّي سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، يَقُولُ :  إِنَّ أُمَّتِي يُدْعَوْنَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنْ آثَارِ الْوُضُوءِ ، فَمَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يُطِيلَ غُرَّتَهُ فَلْيَفْعَلْ  .",
        "urduHadith": " میں  ( ایک مرتبہ )  ابوہریرہ رضی اللہ عنہ کے ساتھ مسجد کی چھت پر چڑھا۔ تو آپ نے وضو کیا اور کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا کہ آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ میری امت کے لوگ وضو کے نشانات کی وجہ سے قیامت کے دن سفید پیشانی اور سفید ہاتھ پاؤں والوں کی شکل میں بلائے جائیں گے۔ تو تم میں سے جو کوئی اپنی چمک بڑھانا چاہتا ہے تو وہ بڑھا لے  ( یعنی وضو اچھی طرح کرے ) ۔ ",
        "englishHadith": " Narrated Nu`am Al-Mujmir: Once I went up the roof of the mosque, along with Abu Huraira. He perform ablution and said,   I heard the Prophet saying,   On the Day of Resurrection, my followers will be called   Al-Ghurr-ul- Muhajjalun   from the trace of ablution and whoever can increase the area of his radiance should do so (i.e. by performing ablution regularly).' ",
        "info": "Sahih Bukhari Hadith No: 136"
    },
    {
        "id": 9,
        "title": "Hadith 10",
        "arabicHadith": "حَدَّثَنَا مُسَدَّدٌ ، حَدَّثَنَا مُعْتَمِرٌ ، قَالَ : سَمِعْتُ أَبِي ، أَنَّ أَنَسًا رَضِيَ اللَّهُ عَنْهُ ، قَالَ :  قِيلَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : لَوْ أَتَيْتَ عَبْدَ اللَّهِ بْنَ أُبَيٍّ ، فَانْطَلَقَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَكِبَ حِمَارًا ، فَانْطَلَقَ الْمُسْلِمُونَ يَمْشُونَ مَعَهُ وَهِيَ أَرْضٌ سَبِخَةٌ ، فَلَمَّا أَتَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ : إِلَيْكَ عَنِّي ، وَاللَّهِ لَقَدْ آذَانِي نَتْنُ حِمَارِكَ ، فَقَالَ رَجُلٌ مِنْ الْأَنْصَارِ مِنْهُمْ : وَاللَّهِ لَحِمَارُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَطْيَبُ رِيحًا مِنْكَ ، فَغَضِبَ لِعَبْدِ اللَّهِ رَجُلٌ مِنْ قَوْمِهِ فَشَتَمَهُ ، فَغَضِبَ لِكُلِّ وَاحِدٍ مِنْهُمَا أَصْحَابُهُ ، فَكَانَ بَيْنَهُمَا ضَرْبٌ بِالْجَرِيدِ وَالْأَيْدِي وَالنِّعَالِ  ، فَبَلَغَنَا أَنَّهَا أُنْزِلَتْ وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا سورة الحجرات آية 9 ",
        "urduHadith": " نبی کریم صلی اللہ علیہ وسلم سے عرض کیا گیا، اگر آپ عبداللہ بن ابی  ( منافق )  کے یہاں تشریف لے چلتے تو بہتر تھا۔ آپ صلی اللہ علیہ وسلم اس کے یہاں ایک گدھے پر سوار ہو کر تشریف لے گئے۔ صحابہ رضوان اللہ علیہم پیدل آپ صلی اللہ علیہ وسلم کے ہمراہ تھے۔ جدھر سے آپ صلی اللہ علیہ وسلم گزر رہے تھے وہ شور زمین تھی۔ جب نبی کریم صلی اللہ علیہ وسلم اس کے یہاں پہنچے تو وہ کہنے لگا ذرا آپ دور ہی رہئیے آپ کے گدھے کی بو نے میرا دماغ پریشان کر دیا ہے۔ اس پر ایک انصاری صحابی بولے کہ اللہ کی قسم! رسول اللہ صلی اللہ علیہ وسلم کا گدھا تجھ سے زیادہ خوشبودار ہے۔ عبداللہ  ( منافق )  کی طرف سے اس کی قوم کا ایک شخص اس صحابی کی اس بات پر غصہ ہو گیا اور دونوں نے ایک دوسرے کو برا بھلا کہا۔ پھر دونوں طرف سے دونوں کے حمایتی مشتعل ہو گئے اور ہاتھا پائی، چھڑی اور جوتے تک نوبت پہنچ گئی۔ ہمیں معلوم ہوا ہے کہ یہ آیت اسی موقع پر نازل ہوئی تھی۔ «وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما» ”اگر مسلمانوں کے دو گروہ آپس میں لڑ پڑیں تو ان میں صلح کرا دو۔“ ",
        "englishHadith": " Narrated Anas: It was said to the Prophet   Would that you see `Abdullah bin Ubai.   So, the Prophet went to him, riding a donkey, and the Muslims accompanied him, walking on salty barren land. When the Prophet reached `Abdullah bin Ubai, the latter said,   Keep away from me! By Allah, the bad smell of your donkey has harmed me.   On that an Ansari man said (to `Abdullah),   By Allah! The smell of the donkey of Allah's Apostle is better than your smell.   On that a man from `Abdullah's tribe got angry for `Abdullah's sake, and the two men abused each other which caused the friends of the two men to get angry, and the two groups started fighting with sticks, shoes and hands. We were informed that the following Divine Verse was revealed (in this concern):--   And if two groups of Believers fall to fighting then, make peace between them.   (49.9) ",
        "info": "Sahih Bukhari Hadith No: 2691"
    }
]